app/Http/Controllers/ReportesController.php

select * from `reportes` where `personal_id` = 1 and `estado` in (5, 7)
select * from `vs_estado` where `vs_estado`.`id` in ('7')
select * from `personals` where `personals`.`id` = 1 and `personals`.`id` is not null limit 1
---
    public function index()
    {
        $historiales = reportes::with('personal', 'EstadoReporte')
            ->where('personal_id', Auth::user()->personal->id)
            ->whereIn('estado', [5, 7])
            ->get();
            $estados = vs_estado::all();